CSI API ETABS v1
cCaseModalEigen.GetParameters Method
 This function retrieves various parameters for the specified load case.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetParameters(
	string Name,
	ref double EigenShiftFreq,
	ref double EigenCutOff,
	ref double EigenTol,
	ref int AllowAutoFreqShift
)
Function GetParameters (
	Name As String,
	ByRef EigenShiftFreq As Double,
	ByRef EigenCutOff As Double,
	ByRef EigenTol As Double,
	ByRef AllowAutoFreqShift As Integer
) As Integer
Dim instance As cCaseModalEigen
Dim Name As String
Dim EigenShiftFreq As Double
Dim EigenCutOff As Double
Dim EigenTol As Double
Dim AllowAutoFreqShift As Integer
Dim returnValue As Integer
returnValue = instance.GetParameters(Name,
	EigenShiftFreq, EigenCutOff, EigenTol,
	AllowAutoFreqShift)
int GetParameters(
	String^ Name,
	double% EigenShiftFreq,
	double% EigenCutOff,
	double% EigenTol,
	int% AllowAutoFreqShift
)
abstract GetParameters :
        Name : string *
        EigenShiftFreq : float byref *
        EigenCutOff : float byref *
        EigenTol : float byref *
        AllowAutoFreqShift : int byref -> int
Parameters
Name
Type: System.String
 The name of an existing modal Eigen load case.
EigenShiftFreq
Type: System.Double
 The Eigenvalue shift frequency. [cyc/s]
EigenCutOff
Type: System.Double
 The Eigencutoff frequency radius. [cyc/s]
EigenTol
Type: System.Double
 The relative convergence tolerance for Eigenvalues.
AllowAutoFreqShift
Type: System.Int32
 This is either 0 or 1, indicating if automatic frequency shifting is allowed. 0 = Automatic frequency shifting is NOT allowed 1 = Automatic frequency shifting Is allowed
Return Value
Type: Int32
 The function returns zero if the parameters are successfully retrieved; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
   Dim SapModel As cSapModel
   Dim EtabsObject As cOAPI
   Dim ret As Integer = -1
   Dim EigenShiftFreq As Double
   Dim EigenCutOff As Double
   Dim EigenTol As Double
   Dim AllowAutoFreqShift As Integer
'create ETABS object
   Dim myHelper as cHelper = New Helper
   EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
'start ETABS application
  ret = EtabsObject.ApplicationStart()
'create SapModel object
   SapModel = EtabsObject.SapModel
'initialize model
   ret = SapModel.InitializeNewModel()
'create steel deck template model
    ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
'add modal Eigen load case
    ret = SapModel.LoadCases.ModalEigen.SetCase("LCASE1")
'get load data
   ret = mySapModel.LoadCases.ModalEigen.GetParameters("LCASE1", EigenShiftFreq, EigenCutOff, EigenTol, AllowAutoFreqShift)
'close ETABS
   EtabsObject.ApplicationExit(False)
'clean up variables
   SapModel = Nothing
   EtabsObject = Nothing
End Sub
See Also
Reference
cCaseModalEigen Interface
ETABSv1 Namespace